# Series Data Structure

In [3]:
import pandas as pd

x = [3,4,5,6,7,8]

var = pd.Series(x)

print(var)
print(type(var))
# if we want to get 5 than
print(var[2])

0    3
1    4
2    5
3    6
4    7
5    8
dtype: int64
<class 'pandas.core.series.Series'>
5

if we want to change the index

In [6]:
import pandas as pd

x = [3, 4, 5, 6]
var = pd.Series(x, index=['a', 's', 'd', 'f'])

print(var)
print(type(var))

# Correct way to get the third element (value 5)
print(var.iloc[2]) # .iloc[] means: “I want to access strictly by position, no guessing.”

a    3
s    4
d    5
f    6
dtype: int64
<class 'pandas.core.series.Series'>
5

if we also want to change the datatype than use this

In [7]:
import pandas as pd

x = [3, 4, 5, 6]
var = pd.Series(x, index=['a', 's', 'd', 'f'],dtype="float")

print(var)
print(type(var))

# Correct way to get the third element (value 5)
print(var.iloc[2])

a    3.0
s    4.0
d    5.0
f    6.0
dtype: float64
<class 'pandas.core.series.Series'>
5.0

if we want to print the name

In [8]:
import pandas as pd

x = [3, 4, 5, 6]
var = pd.Series(x, index=['a', 's', 'd', 'f'],dtype="float",name="python")

print(var)
print(type(var))

# Correct way to get the third element (value 5)
print(var.iloc[2])

a    3.0
s    4.0
d    5.0
f    6.0
Name: python, dtype: float64
<class 'pandas.core.series.Series'>
5.0

making a series using of dictionary

In [12]:
dic = {"name": ['python','c','c++','java'],"por":[12,13,14,15],"rank":[1,2,3,4]}

var1 = pd.Series(dic)

print(var1)

name    [python, c, c++, java]
por           [12, 13, 14, 15]
rank              [1, 2, 3, 4]
dtype: object

making a series using a single datatype

In [13]:
s = pd.Series(12)

print(s)
print(type(s))

0    12
dtype: int64
<class 'pandas.core.series.Series'>

making a blocks of single data

In [14]:
s = pd.Series(12,index=[1,2,3,4,5,6,7])

print(s)
print(type(s))

1    12
2    12
3    12
4    12
5    12
6    12
7    12
dtype: int64
<class 'pandas.core.series.Series'>

No use of broadcasting in Pandas

In [16]:
s1 = pd.Series(12,index=[1,2,3,4,5,6,7])
s2 = pd.Series(12,index=[1,2,3,4]) # Pandas messing data ke upar bhi work perform krta hai

print(s1+s2)

1    24.0
2    24.0
3    24.0
4    24.0
5     NaN
6     NaN
7     NaN
dtype: float64

# DataFrame Data Structures in Pandas

Creating a DataFrame Using a list

In [5]:
import pandas as pd

l = [1, 2, 3, 4, 5, 6]
var = pd.DataFrame({'numbers': l})   # specify column name

# print(var)
var
print(type(var))

<class 'pandas.core.frame.DataFrame'>

Creating a DataFrame Using a dictionary

In [6]:
d = {"a":[1,2,3,4,5],"s":[1,2,3,4,5]}

var1 = pd.DataFrame(d)

print(type(var1))
print(var1)

<class 'pandas.core.frame.DataFrame'>
   a  s
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5

For getting the column of the list so,

In [7]:
d = {"a":[1,2,3,4,5],"s":[1,2,3,4,5],"d":[1,2,3,4,5],1:[1,2,3,4,5]}

var1 = pd.DataFrame(d,columns=["a",1])

print(type(var1))
print(var1)

<class 'pandas.core.frame.DataFrame'>
   a  1
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5

if we want to change the index than

In [8]:
d = {"a":[1,2,3,4,5],"s":[1,2,3,4,5],"d":[1,2,3,4,5],1:[1,2,3,4,5]}

var1 = pd.DataFrame(d,columns=["a",1],index=["a","s","d","f","g"])

print(type(var1))
print(var1)

<class 'pandas.core.frame.DataFrame'>
   a  1
a  1  1
s  2  2
d  3  3
f  4  4
g  5  5

if we want to get the perticular value of the list than use

In [10]:
d = {"a":[1,2,3,14,5],"s":[1,2,3,4,5],"d":[1,2,3,4,5],1:[1,2,3,4,5]}

var1 = pd.DataFrame(d)

print(type(var1))
print(var1)
print(var1["a"][3])

<class 'pandas.core.frame.DataFrame'>
    a  s  d  1
0   1  1  1  1
1   2  2  2  2
2   3  3  3  3
3  14  4  4  4
4   5  5  5  5
14

# Creating a DataFrame using List of Lists

In [11]:
list_1 = [[1,2,3,4,5],[11,12,13,14,15]]

var2 = pd.DataFrame(list_1)

print(type(var2))
print(var2)

<class 'pandas.core.frame.DataFrame'>
    0   1   2   3   4
0   1   2   3   4   5
1  11  12  13  14  15

# Creating a DataFrame using a Series

In [12]:
sr = {"s":pd.Series([1,2,3,4]),"r":pd.Series([1,2,3,4])}

var3 = pd.DataFrame(sr)

print(type(var3))
print(var3)

<class 'pandas.core.frame.DataFrame'>
   s  r
0  1  1
1  2  2
2  3  3
3  4  4

# Arithmetic Operations in Python Pandas

In [13]:
import pandas as pd

var = pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})

var

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

Addition

In [14]:
var["C"] = var["A"] + var["B"]
var

   A  B   C
0  1  5   6
1  2  6   8
2  3  7  10
3  4  8  12

Substraction

In [15]:
var["C"] = var["A"] - var["B"]
var

   A  B  C
0  1  5 -4
1  2  6 -4
2  3  7 -4
3  4  8 -4

Multiplication

In [16]:
var["C"] = var["A"] * var["B"]
var

   A  B   C
0  1  5   5
1  2  6  12
2  3  7  21
3  4  8  32

Division

In [17]:
var["C"] = var["A"] / var["B"]
var

   A  B         C
0  1  5  0.200000
1  2  6  0.333333
2  3  7  0.428571
3  4  8  0.500000

# For the Logical Operation

In [18]:
var1 = pd.DataFrame({"A":[10,20,30,40],"B":[15,16,17,18]})

var1

    A   B
0  10  15
1  20  16
2  30  17
3  40  18

printing the data <= 20.

In [19]:
var1["Python"] = var1["A"] <= 20

var1

    A   B  Python
0  10  15    True
1  20  16    True
2  30  17   False
3  40  18   False

printing the data <= 20 in A && above >= 16 in B

In [21]:
var1["Python"] = var1["A"] <= 20
var1["Python"] = var1["B"] >= 16

var1

    A   B  Python
0  10  15   False
1  20  16    True
2  30  17    True
3  40  18    True

# Insert Functions in Python Pandas

In [22]:
import pandas as pd

var = pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5]})

var

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [37]:
import pandas as pd

var = pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5]})

var.insert(1,"python",var["A"])

var

   A  python  B
0  1       1  9
1  2       2  8
2  3       3  7
3  4       4  6
4  5       5  5

In [38]:
var.insert(1,"python_1",[11,12,13,14,15])

var

   A  python_1  python  B
0  1        11       1  9
1  2        12       2  8
2  3        13       3  7
3  4        14       4  6
4  5        15       5  5

if we want to print limited amount of data inside this than

In [39]:
import pandas as pd

var = pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5]})

var

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [40]:
var["python_12"] = var["A"][:3]

var

   A  B  python_12
0  1  9        1.0
1  2  8        2.0
2  3  7        3.0
3  4  6        NaN
4  5  5        NaN

so, is trah se hm nye column ko insert kra skte hai and data ko copy kra skte hai.

# Delete

In [42]:
import pandas as pd

var = pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5],"C":[11,12,13,14,15]})

var

   A  B   C
0  1  9  11
1  2  8  12
2  3  7  13
3  4  6  14
4  5  5  15

if we want to delete the data B than

In [43]:
var1 = var.pop("B")

var1

0    9
1    8
2    7
3    6
4    5
Name: B, dtype: int64

for the original data

In [44]:
var

   A   C
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15

In [45]:
del var["A"]

var

    C
0  11
1  12
2  13
3  14
4  15